/* ヘッダファイル */
#include "BaseScene.h"


//-------------------------------------------------------------
//!
//! @brief シーン
//! @brief シーン関連の名前空間
//!
//-------------------------------------------------------------
namespace Scene
{
    /*************************************************************//**
     *
     *  @brief  コンストラクタ
     *  @param  なし
     *
     ****************************************************************/
    C_BaseScene::C_BaseScene()
    {
    }


    /*************************************************************//**
     *
     *  @brief  デストラクタ
     *  @param  なし
     *
     ****************************************************************/
    C_BaseScene::~C_BaseScene()
    {
    }


    /*************************************************************//**
     *
     *  @brief  初期化処理を行う
     *  @param  なし
     *  @return SUCCESSFUL
     *
     ****************************************************************/
    ecSceneReturn C_BaseScene::Initialize()
    {
        return ecSceneReturn::SUCCESSFUL;
    }


    /*************************************************************//**
     *
     *  @brief  終了処理を行う
     *  @param  なし
     *  @return なし
     *
     ****************************************************************/
    void C_BaseScene::Finalize()
    {
    }


    /*************************************************************//**
     *
     *  @brief  更新フラグを取得する
     *  @param  なし
     *  @return 更新フラグ
     *
     ****************************************************************/
    bool C_BaseScene::IsUpdateFlag() const
    {
        return updateFlag_;
    }


    /*************************************************************//**
     *
     *  @brief  描画フラグを取得する
     *  @param  なし
     *  @return 描画フラグ
     *
     ****************************************************************/
    bool C_BaseScene::IsDrawFlag() const
    {
        return drawFlag_;
    }


    /*************************************************************//**
     *
     *  @brief  更新フラグを設定する
     *  @param  更新フラグ
     *  @return なし
     *
     ****************************************************************/
    void C_BaseScene::SetUpdateFlag(bool updateFlag)
    {
        updateFlag_ = updateFlag;
    }


    /*************************************************************//**
     *
     *  @brief  描画フラグを設定する
     *  @param  描画フラグ
     *  @return なし
     *
     ****************************************************************/
    void C_BaseScene::SetDrawFlag(bool drawFlag)
    {
        drawFlag_ = drawFlag;
    }


    /*************************************************************//**
     *
     *  @brief  シーンチェンジャーを設定する
     *  @param  シーンチェンジャー
     *  @return なし
     *
     ****************************************************************/
    void C_BaseScene::SetSceneChanger(IC_SceneChanger* pSceneChanger)
    {
        pSceneChanger_ = pSceneChanger;
    }


    /*************************************************************//**
     *
     *  @brief  親のシーンを設定する
     *  @param  親のシーン
     *  @return なし
     *
     ****************************************************************/
    void C_BaseScene::SetParentScene(C_BaseScene* pParentScene)
    {
        pParentScene_ = pParentScene;
    }



    /*************************************************************//**
     *
     *  @brief  シーンチェンジャーを取得する
     *  @param  なし
     *  @return シーンチェンジャー
     *
     ****************************************************************/
    IC_SceneChanger* C_BaseScene::GetSceneChanger() const
    {
        return pSceneChanger_;
    }


    /*************************************************************//**
     *
     *  @brief  親のシーンを取得する
     *  @param  なし
     *  @return 親のシーン
     *
     ****************************************************************/
    C_BaseScene* C_BaseScene::GetParentScene() const
    {
        return pParentScene_;
    }
}