/* ヘッダファイル */
#include "SphereShape.h"


//-------------------------------------------------------------
///
/// @brief フィジックス
/// @brief 物理関連の名前空間
///
//-------------------------------------------------------------
namespace Physics
{
    /*************************************************************//**
     *
     *  @brief  コンストラクタ
     *  @param  半径
     *
     ****************************************************************/
    C_SphereShape::C_SphereShape(float radius)
    {
        upCollisionShape_ = std::make_unique<btSphereShape>(radius);
    }


    /*************************************************************//**
     *
     *  @brief  デストラクタ
     *  @param  なし
     *
     ****************************************************************/
    C_SphereShape::~C_SphereShape()
    {
    }
}