/* 二重インクルード防止 */
#pragma once


/* ヘッダファイル */
#include "../../CollisionShape.h"


//-------------------------------------------------------------
///
/// @brief フィジックス
/// @brief 物理関連の名前空間
///
//-------------------------------------------------------------
namespace Physics
{
    //-------------------------------------------------------------
    //!
    //! @brief スフィアシェイプ
    //! @brief 球形状を表すクラス
    //!
    //-------------------------------------------------------------
    class C_SphereShape : public C_CollisionShape
    {
    public:
        C_SphereShape(float radius);            // コンストラクタ
        ~C_SphereShape() override;              // デストラクタ
    };
}