/* ヘッダファイル */
#include "LightManagerImpl.h"


//-------------------------------------------------------------
//!
//! @brief ライト
//! @brief ライト関連の名前空間
//!
//-------------------------------------------------------------
namespace Light
{
    /*************************************************************//**
     *
     *  @brief  コンストラクタ
     *  @param  なし
     *
     ****************************************************************/
    C_LightManager::C_LightManager() :

        // 実装情報
        upImpl_(std::make_unique<C_LightManagerImpl>())

    {
    }


    /*************************************************************//**
     *
     *  @brief  デストラクタ
     *  @param  なし
     *
     ****************************************************************/
    C_LightManager::~C_LightManager()
    {
    }


    /*************************************************************//**
     *
     *  @brief  ライトの登録を行う
     *  @param  ライト
     *  @param  ID
     *  @return なし
     *
     ****************************************************************/
    void C_LightManager::Entry(const LightPtr& prLight, const std::string& rId)
    {
        upImpl_->Entry(prLight, rId);
    }


    /*************************************************************//**
     *
     *  @brief  ライトの除去を行う
     *  @param  ID
     *  @return なし
     *
     ****************************************************************/
    void C_LightManager::Remove(const std::string& rId)
    {
        upImpl_->Remove(rId);
    }


    /*************************************************************//**
     *
     *  @brief  全てのライトの除去を行う
     *  @param  なし
     *  @return なし
     *
     ****************************************************************/
    void C_LightManager::AllRemove()
    {
        upImpl_->AllRemove();
    }


    /*************************************************************//**
     *
     *  @brief  ライトを取得する
     *  @param  ID
     *  @return 取得できた場合      ：ライト
     *  @return 取得できなかった場合：none
     *
     ****************************************************************/
    boost::optional<const LightPtr&> C_LightManager::GetLight(const std::string& rId) const
    {
        return upImpl_->GetLight(rId);
    }
}