//-------------------------------------------------------------
//!
//! @brief シングルトン
//! @brief シングルトン関連の名前空間
//!
//-------------------------------------------------------------
namespace Singleton
{
    /*************************************************************//**
     *
     *  @brief  コンストラクタ
     *  @param  なし
     *
     ****************************************************************/
    template<typename T>
    inline C_Singleton<T>::C_Singleton()
    {
    }


    /*************************************************************//**
     *
     *  @brief  デストラクタ
     *  @param  なし
     *
     ****************************************************************/
    template<typename T>
    inline C_Singleton<T>::~C_Singleton()
    {
    }


    /*************************************************************//**
     *
     *  @brief  唯一のインスタンスを取得する
     *  @param  なし
     *  @return 唯一のインスタンス
     *
     ****************************************************************/
    template<typename T>
    inline T* C_Singleton<T>::s_GetInstance()
    {
        // 唯一のインスタンス
        static T s_instance;

        // 唯一のインスタンスのアドレスを返す
        return &s_instance;
    }
}