/* ヘッダファイル */
#include "BaseHitPoint.h"


//-------------------------------------------------------------
//!
//! @brief コネクトウォーズ
//! @brief コネクトウォーズ関連の名前空間
//!
//-------------------------------------------------------------
namespace ConnectWars
{
    /*************************************************************//**
     *
     *  @brief  コンストラクタ
     *  @param  最大値
     *
     ****************************************************************/
    C_BaseHitPoint::C_BaseHitPoint(int32_t maxValue) :

        // 値
        value_(maxValue),

        // 最大値
        maxValue_(maxValue)

    {
    }


    /*************************************************************//**
     *
     *  @brief  デストラクタ
     *  @param  なし
     *
     ****************************************************************/
    C_BaseHitPoint::~C_BaseHitPoint()
    {
    }


    /*************************************************************//**
     *
     *  @brief  値を初期状態に戻す
     *  @param  最大値
     *  @return なし
     *
     ****************************************************************/
    void C_BaseHitPoint::Reset()
    {
        SetValue(maxValue_);
    }


    /*************************************************************//**
     *
     *  @brief  値を足す
     *  @param  値
     *  @return なし
     *
     ****************************************************************/
    void C_BaseHitPoint::Add(int32_t hitPoint)
    {
        value_ += hitPoint;

        if (value_ > maxValue_) SetValue(maxValue_);
    }


    /*************************************************************//**
     *
     *  @brief  値を引く
     *  @param  値
     *  @return なし
     *
     ****************************************************************/
    void C_BaseHitPoint::Subtract(int32_t hitPoint)
    {
        value_ -= hitPoint;

        if (value_ > maxValue_) SetValue(maxValue_);
    }


    /*************************************************************//**
     *
     *  @brief  値が残っているか確認を行う
     *  @param  なし
     *  @return 値が残っている  ：true
     *  @return 値が残っていない：false
     *
     ****************************************************************/
    bool C_BaseHitPoint::CheckRemainValue() const
    {
        return value_ > 0;
    }


    /*************************************************************//**
     *
     *  @brief  値を取得する
     *  @param  なし
     *  @return 値
     *
     ****************************************************************/
    int32_t C_BaseHitPoint::GetValue() const
    {
        return value_;
    }


    /*************************************************************//**
     *
     *  @brief  最大値を取得する
     *  @param  なし
     *  @return 最大値
     *
     ****************************************************************/
    int32_t C_BaseHitPoint::GetMaxValue() const
    {
        return maxValue_;
    }


    /*************************************************************//**
     *
     *  @brief  値を設定する
     *  @param  値
     *  @return なし
     *
     ****************************************************************/
    void C_BaseHitPoint::SetValue(int32_t hitPoint)
    {
        (hitPoint <= maxValue_) ? (value_ = hitPoint) : SetValue(maxValue_);
    }


    /*************************************************************//**
     *
     *  @brief  最大値を設定する
     *  @param  最大値
     *  @return なし
     *
     ****************************************************************/
    void C_BaseHitPoint::SetMaxValue(int32_t maxValue)
    {
        maxValue_ = maxValue;
    }
}