/* ヘッダファイル */
#include "BaseHitPoint.h"


//-------------------------------------------------------------
//!
//! @brief コネクトウォーズ
//! @brief コネクトウォーズ関連の名前空間
//!
//-------------------------------------------------------------
namespace ConnectWars
{
    /*************************************************************//**
     *
     *  @brief  コンストラクタ
     *  @param  最大ヒットポイント
     *
     ****************************************************************/
    C_BaseHitPoint::C_BaseHitPoint(int32_t maxHitPoint) :

        // ヒットポイント
        hitPoint_(maxHitPoint),

        // 最大ヒットポイント
        maxHitPoint_(maxHitPoint)

    {
    }


    /*************************************************************//**
     *
     *  @brief  デストラクタ
     *  @param  なし
     *
     ****************************************************************/
    C_BaseHitPoint::~C_BaseHitPoint()
    {
    }


    /*************************************************************//**
     *
     *  @brief  ヒットポイントを初期状態に戻す
     *  @param  最大ヒットポイント
     *  @return なし
     *
     ****************************************************************/
    void C_BaseHitPoint::Reset()
    {
        SetHitPoint(maxHitPoint_);
    }


    /*************************************************************//**
     *
     *  @brief  ヒットポイントを加える
     *  @param  ヒットポイント
     *  @return なし
     *
     ****************************************************************/
    void C_BaseHitPoint::Add(int32_t hitPoint)
    {
        hitPoint_ += hitPoint;

        if (hitPoint_ > maxHitPoint_) SetHitPoint(maxHitPoint_);
    }


    /*************************************************************//**
     *
     *  @brief  ヒットポイントが残っているか確認を行う
     *  @param  なし
     *  @return ヒットポイントが残っている  ：true
     *  @return ヒットポイントが残っていない：false
     *
     ****************************************************************/
    bool C_BaseHitPoint::CheckRemainHitPoint() const
    {
        return hitPoint_ > 0;
    }


    /*************************************************************//**
     *
     *  @brief  ヒットポイントを取得する
     *  @param  なし
     *  @return ヒットポイント
     *
     ****************************************************************/
    int32_t C_BaseHitPoint::GetHitPoint() const
    {
        return hitPoint_;
    }


    /*************************************************************//**
     *
     *  @brief  最大ヒットポイントを取得する
     *  @param  なし
     *  @return 最大ヒットポイント
     *
     ****************************************************************/
    int32_t C_BaseHitPoint::GetMaxHitPoint() const
    {
        return maxHitPoint_;
    }


    /*************************************************************//**
     *
     *  @brief  ヒットポイントを設定する
     *  @param  ヒットポイント
     *  @return なし
     *
     ****************************************************************/
    void C_BaseHitPoint::SetHitPoint(int32_t hitPoint)
    {
        (hitPoint <= maxHitPoint_) ? (hitPoint_ = hitPoint) : SetHitPoint(maxHitPoint_);
    }


    /*************************************************************//**
     *
     *  @brief  最大ヒットポイントを設定する
     *  @param  最大ヒットポイント
     *  @return なし
     *
     ****************************************************************/
    void C_BaseHitPoint::SetMaxHitPoint(int32_t maxHitPoint)
    {
        maxHitPoint_ = maxHitPoint;
    }
}