/* 二重インクルード防止 */
#pragma once


//-------------------------------------------------------------
//!
//! @brief コネクトウォーズ
//! @brief コネクトウォーズ関連の名前空間
//!
//-------------------------------------------------------------
namespace ConnectWars
{
    //-------------------------------------------------------------
    //!
    //! @brief コリジョンコールバック
    //! @brief 衝突のコールバック処理を行う関数をまとめたユーティリティクラス
    //!
    //-------------------------------------------------------------
    class C_CollisionCallback
    {
    public:
        static bool s_ContactProcess(btManifoldPoint& rManifoldPoint, void* pBody, void* pAnotherBody);
    };
}