/* ヘッダファイル */
#include "EnemyDestroyedState.h"
#include "BaseEnemy.h"


//-------------------------------------------------------------
//!
//! @brief コネクトウォーズ
//! @brief コネクトウォーズ関連の名前空間
//!
//-------------------------------------------------------------
namespace ConnectWars
{
    /*************************************************************//**
     *
     *  @brief  コンストラクタ
     *  @param  なし
     *
     ****************************************************************/
    C_EnemyDestroyedState::C_EnemyDestroyedState()
    {
    }


    /*************************************************************//**
     *
     *  @brief  デストラクタ
     *  @param  なし
     *
     ****************************************************************/
    C_EnemyDestroyedState::~C_EnemyDestroyedState()
    {
    }


    /*************************************************************//**
     *
     *  @brief  開始処理を行う
     *  @param  敵
     *  @return なし
     *
     ****************************************************************/
    void C_EnemyDestroyedState::Enter(C_BaseEnemy* pEnemy)
    {
    }


    /*************************************************************//**
     *
     *  @brief  実行処理を行う
     *  @param  敵
     *  @return なし
     *
     ****************************************************************/
    void C_EnemyDestroyedState::Execute(C_BaseEnemy* pEnemy)
    {
    }


    /*************************************************************//**
     *
     *  @brief  終了処理を行う
     *  @param  敵
     *  @return なし
     *
     ****************************************************************/
    void C_EnemyDestroyedState::Exit(C_BaseEnemy* pEnemy)
    {
    }


    /*************************************************************//**
     *
     *  @brief  メッセージ処理を行う
     *  @param  敵
     *  @param  テレグラム
     *  @return 正常終了：true
     *  @return 異常終了：false
     *
     ****************************************************************/
    bool C_EnemyDestroyedState::MessageProcess(C_BaseEnemy* pEnemy, const Telegram& rTelegram)
    {
        return true;
    }
}