/* ヘッダファイル */
#include "Shooter.h"
/*
#include "BasePlayer.h"
#include "BaseOption.h"
#include "BaseEnemy.h"
#include "BaseBullet.h"
*/


//-------------------------------------------------------------
//!
//! @brief コネクトウォーズ
//! @brief コネクトウォーズ関連の名前空間
//!
//-------------------------------------------------------------
namespace ConnectWars
{
    /*************************************************************//**
     *
     *  @brief  コンストラクタ
     *  @param  ID
     *  @param  種類
     *
     ****************************************************************/
    C_Shooter::C_Shooter(const std::string& rId, int32_t type) : C_CollisionObject(rId, type)
    {
    }


    /*************************************************************//**
     *
     *  @brief  デストラクタ
     *  @param  なし
     *
     ****************************************************************/
    C_Shooter::~C_Shooter()
    {
    }
}