/* ヘッダファイル */
#include "ShotLogic.h"


//-------------------------------------------------------------
//!
//! @brief コネクトウォーズ
//! @brief コネクトウォーズ関連の名前空間
//!
//-------------------------------------------------------------
namespace ConnectWars
{
    /*************************************************************//**
     *
     *  @brief  コンストラクタ
     *  @param  射撃の間隔
     *
     ****************************************************************/
    C_ShotLogic::C_ShotLogic(int32_t shotInterval) :

        // 射撃の間隔
        shotInterval_(shotInterval)

    {
        assert(shotInterval > 0);
    }


    /*************************************************************//**
     *
     *  @brief  デストラクタ
     *  @param  なし
     *
     ****************************************************************/
    C_ShotLogic::~C_ShotLogic()
    {
    }


    /*************************************************************//**
     *
     *  @brief  射撃の間隔を設定する
     *  @param  射撃の間隔
     *  @return なし
     *
     ****************************************************************/
    void C_ShotLogic::SetShotInterval(int32_t shotInterval)
    {
        assert(shotInterval > 0);

        shotInterval_ = shotInterval;
    }


    /*************************************************************//**
     *
     *  @brief  処理を行う
     *  @param  なし
     *  @return 射撃準備完了：true
     *  @return 射撃準備中  ：false
     *
     ****************************************************************/
    bool C_ShotLogic::Process()
    {
        return DoProcess();
    }
}