/* 二重インクルード防止 */
#pragma once


/* ヘッダファイル */
#include "../Light.h"


//-------------------------------------------------------------
//!
//! @brief ライト
//! @brief ライト関連の名前空間
//!
//-------------------------------------------------------------
namespace Light
{
    //-------------------------------------------------------------
    //!
    //! @brief ディレクショナルライト
    //! @brief 平行光源を表す構造体
    //!
    //-------------------------------------------------------------
    struct S_DirectionalLight : public S_Light
    {
        Vector3 direction_;                         ///< @brief 向き
        Vector3 diffuse_;                           ///< @brief ディフューズ
	    Vector3 ambient_;                           ///< @brief アンビエント
	    Vector3 specular_;                          ///< @brief スペキュラ
    };
}