/* ヘッダファイル */
#include "BaseWindowEvent.h"


//-------------------------------------------------------------
//!
//! @brief イベント
//! @brief イベント関連の名前空間
//!
//-------------------------------------------------------------
namespace Event
{
    /*************************************************************//**
     *
     *  @brief  コンストラクタ
     *  @param  ウィンドウのID
     *
     ****************************************************************/
    C_BaseWindowEvent::C_BaseWindowEvent(uint32_t windowId) :

        // ウィンドウID
        windowId_(windowId)

    {
    }


    /*************************************************************//**
     *
     *  @brief  デストラクタ
     *  @param  なし
     *
     ****************************************************************/
    C_BaseWindowEvent::~C_BaseWindowEvent()
    {
    }


    /*************************************************************//**
     *
     *  @brief  ウィンドウのIDを取得する
     *  @param  なし
     *  @return ウィンドウのID
     *
     ****************************************************************/
    uint32_t C_BaseWindowEvent::GetWindowId() const
    {
        return windowId_;
    }
}