/* 二重インクルード防止 */
#pragma once


//-------------------------------------------------------------
//!
//! @brief ライト
//! @brief ライト関連の名前空間
//!
//-------------------------------------------------------------
namespace Light
{
    /* 前方宣言 */
    struct S_Light;


    /* 別名 */
    using LightPtr = std::shared_ptr<S_Light>;          // LightPtr型


    //-------------------------------------------------------------
    //!
    //! @brief ライト
    //! @brief ライトの基底構造体
    //!
    //-------------------------------------------------------------
    struct S_Light
    {
    };
}