/* ヘッダファイル */
#include "GameObject.h"


//-------------------------------------------------------------
//!
//! @brief ゲームオブジェクト
//! @brief ゲームに存在するオブジェクト関連の名前空間
//!
//-------------------------------------------------------------
namespace GameObject
{
    /*************************************************************//**
     *
     *  @brief  コンストラクタ
     *  @param  ID
     *  @param  種類
     *
     ****************************************************************/
    C_GameObject::C_GameObject(const std::string& rId, int32_t type) :

        // 名前
        id_(rId),

        // 種類
        type_(type)

    {
    }


    /*************************************************************//**
     *
     *  @brief  デストラクタ
     *  @param  なし
     *
     ****************************************************************/
    C_GameObject::~C_GameObject()
    {
    }


    /*************************************************************//**
     *
     *  @brief  IDに文字列を加える
     *  @param  文字列
     *  @return なし
     *
     ****************************************************************/
    void C_GameObject::AddStringToId(const std::string& rString)
    {
        id_ += rString;
    }


    /*************************************************************//**
     *
     *  @brief  IDを取得する
     *  @param  なし
     *  @return ID
     *
     ****************************************************************/
    const std::string& C_GameObject::GetId() const
    {
        return id_;
    }


    /*************************************************************//**
     *
     *  @brief  種類を取得する
     *  @param  なし
     *  @return 種類
     *
     ****************************************************************/
    int32_t C_GameObject::GetType() const
    {
        return type_;
    }


    /*************************************************************//**
     *
     *  @brief  存在を確認するためのフラグを取得する
     *  @param  なし
     *  @return 存在を確認するフラグ
     *
     ****************************************************************/
    bool C_GameObject::IsExistanceFlag() const
    {
        return existenceFlag_;
    }


    /*************************************************************//**
     *
     *  @brief  IDを設定する
     *  @param  ID
     *  @return なし
     *
     ****************************************************************/
    void C_GameObject::SetId(const std::string& rId)
    {
        id_ = rId;
    }


    /*************************************************************//**
     *
     *  @brief  種類を設定する
     *  @param  種類
     *  @return なし
     *
     ****************************************************************/
    void C_GameObject::SetType(int32_t type)
    {
        type_ = type;
    }


    /*************************************************************//**
     *
     *  @brief  存在を確認するフラグを設定する
     *  @param  存在を確認するフラグ
     *  @return なし
     *
     ****************************************************************/
    void C_GameObject::SetExistanceFlag(bool existanceFlag)
    {
        existenceFlag_ = existanceFlag;
    }
}